constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          800;
        startFace       507400;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       508200;
    }
    nsw
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3600;
        startFace       509800;
    }
    forward
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          17600;
        startFace       513400;
        matchTolerance  0.0001;
        neighbourPatch  backward;
        transformType   translational;
        separation      (0 -1 0);
    }
    backward
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          17600;
        startFace       531000;
        matchTolerance  0.0001;
        neighbourPatch  forward;
        transformType   translational;
        separation      (0 1 0);
    }
)

// ************************************************************************* //
